testsuite/sysbench/results/oltp_read_only.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 4250.52 qps: 68046.89 (r/w/o: 59541.72/0.00/8505.17) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 4345.26 qps: 69525.41 (r/w/o: 60835.09/0.00/8690.32) lat (ms,95%): 57.87 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 127 tps: 4332.80 qps: 69321.55 (r/w/o: 60656.29/0.00/8665.26) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            3647893
        write:                           0
        other:                           521168
        total:                           4169061
    transactions:                        260644 (4342.01 per sec.)
    queries:                             4169061 (69451.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      4342.0149
    time elapsed:                        60.0285s
    total number of events:              260644

Latency (ms):
         min:                                    3.26
         avg:                                   29.48
         max:                                  173.40
         95th percentile:                       58.92
         sum:                              7683600.60

Threads fairness:
    events (avg/stddev):           2036.2188/20.69
    execution time (avg/stddev):   60.0281/0.02

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 4440.98 qps: 71098.93 (r/w/o: 62212.84/0.00/8886.09) lat (ms,95%): 61.08 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 4534.40 qps: 72548.02 (r/w/o: 63479.26/0.00/9068.75) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 4551.60 qps: 72821.14 (r/w/o: 63718.39/0.00/9102.75) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            3818454
        write:                           0
        other:                           545530
        total:                           4363984
    transactions:                        272828 (4545.20 per sec.)
    queries:                             4363984 (72702.21 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      4545.2045
    time elapsed:                        60.0257s
    total number of events:              272828

Latency (ms):
         min:                                    3.02
         avg:                                   28.16
         max:                                  202.24
         95th percentile:                       62.19
         sum:                              7683356.49

Threads fairness:
    events (avg/stddev):           2131.3984/83.55
    execution time (avg/stddev):   60.0262/0.02